#**Trabalhando com Planilhas do Excel**

In [32]:
# SHIFT + ENTER executa esta linha e para automáticamente na outra
#Importando a biblioteca
import pandas as pd

In [33]:
#Leitura dos arquivos
df1 = pd.read_excel("Aracaju.xlsx")
df2 = pd.read_excel("Fortaleza.xlsx")
df3 = pd.read_excel("Natal.xlsx")
df4 = pd.read_excel("Recife.xlsx")
df5 = pd.read_excel("Salvador.xlsx")

In [34]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [35]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [36]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [37]:
# EXIBINDO A TABELA PARCIAL COM DADOS INICIAIS E FINAIS
df

       Cidade       Data  Vendas  LojaID  Qtde
0     Aracaju 2018-01-01  142.00    1520     1
1     Aracaju 2018-01-01   14.21    1522     6
2     Aracaju 2018-01-01   71.55    1520     1
3     Aracaju 2018-01-01    3.01    1521     7
4     Aracaju 2018-01-01   24.51    1522     8
..        ...        ...     ...     ...   ...
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

[894 rows x 5 columns]

In [38]:
#Exibindo as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [39]:
# retorna uma amostra do conjunto de dados com cinco linhas
df.sample(5)

       Cidade       Data  Vendas  LojaID  Qtde
200     Natal 2019-01-02   41.06    1035     1
61   Salvador 2019-01-01    4.54    1036     3
16      Natal 2018-07-01  298.00     854     3
129   Aracaju 2018-01-01   13.70    1522     6
166  Salvador 2019-01-02  111.72    1035     3

In [40]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [41]:
#Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [42]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [43]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

**Tratando valores faltantes**

In [44]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [45]:
#Substituindo os valores nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [46]:
df["Vendas"].mean()

122.61180089485438

In [47]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [48]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
224      Natal 2019-01-02  178.30   1035     3
108    Aracaju 2018-01-01   31.94   1520     8
194      Natal 2019-01-02  156.47   1035     1
17   Fortaleza 2019-01-01  166.80   1004     1
202   Salvador 2019-01-02   22.45   1036     1
13    Salvador 2019-02-12   39.29   1035     1
101   Salvador 2019-01-01   32.28   1035     3
173   Salvador 2019-01-02   31.77   1034     2
17     Aracaju 2018-01-01  162.19   1522     9
211      Natal 2019-01-02  141.05   1035     3
127    Aracaju 2018-01-01   33.12   1522     9
105    Aracaju 2018-01-01   24.81   1520     5
48     Aracaju 2018-01-01   35.90   1521     8
16     Aracaju 2018-01-01   37.68   1522    10
41   Fortaleza 2019-02-13  191.29   1002     3

In [49]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [50]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [51]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [52]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

**Criando colunas novas**

In [53]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [54]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [55]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [56]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [57]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [58]:
#Retornando a menor receita
df["Receita"].min()

3.34

In [59]:
#nlargest
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [60]:
#nsamllest
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [61]:
#Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [62]:
#Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

#**Trabalhando com datas**

In [63]:
#Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [64]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [65]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [66]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [67]:
#Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [68]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [69]:
df.sample(5)

        Cidade       Data  Vendas  ...  Receita  Receita/Vendas  Ano_Venda
233   Salvador 2019-01-03  172.40  ...   344.80             2.0       2019
24    Salvador 2019-01-01   15.60  ...    31.20             2.0       2019
11      Recife 2019-01-01  202.79  ...  1013.95             5.0       2019
76     Aracaju 2018-01-01   33.51  ...   134.04             4.0       2018
123  Fortaleza 2019-03-02   20.22  ...   121.32             6.0       2019

[5 rows x 8 columns]

In [70]:
#Extraindo o mês e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [71]:
df.sample(5)

        Cidade       Data  Vendas  ... Ano_Venda  mes_venda  dia_venda
103      Natal 2019-01-02  191.60  ...      2019          1          2
231      Natal 2019-01-03   89.85  ...      2019          1          3
16   Fortaleza 2019-01-01   97.32  ...      2019          1          1
168   Salvador 2019-01-02   20.22  ...      2019          1          2
96       Natal 2019-01-02   42.94  ...      2019          1          2

[5 rows x 10 columns]

In [72]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [73]:
#Calculando a diferença de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [74]:
df.sample(5)

        Cidade       Data  Vendas  ... mes_venda  dia_venda  diferenca_dias
11    Salvador 2019-01-01   30.62  ...         1          1        365 days
11   Fortaleza 2019-01-01   42.19  ...         1          1        365 days
100     Recife 2019-01-01   35.11  ...         1          1        365 days
120      Natal 2019-01-02  140.17  ...         1          2        366 days
1      Aracaju 2018-01-01   14.21  ...         1          1          0 days

[5 rows x 11 columns]

In [75]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [76]:
df.sample(5)

        Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
114    Aracaju 2018-01-01   10.17  ...         1          0 days                1
108     Recife 2019-03-02  152.89  ...         2        425 days                1
53    Salvador 2019-01-01   39.50  ...         1        365 days                1
120  Fortaleza 2019-03-02  184.90  ...         2        425 days                1
92     Aracaju 2018-01-01   37.46  ...         1          0 days                1

[5 rows x 12 columns]

In [77]:
#Filtrando as vendas de 2019 do mês de março
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [78]:
vendas_marco_19.sample(20)

        Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
124   Salvador 2019-03-02   44.82  ...         2        425 days                1
2        Natal 2019-03-11  308.00  ...        11        434 days                1
46       Natal 2019-03-26  753.00  ...        26        449 days                1
7        Natal 2019-03-18  886.00  ...        18        441 days                1
32       Natal 2019-03-17  244.00  ...        17        440 days                1
4        Natal 2019-03-09  699.00  ...         9        432 days                1
122     Recife 2019-03-02  235.06  ...         2        425 days                1
69       Natal 2019-03-24  817.00  ...        24        447 days                1
135   Salvador 2019-03-02    9.95  ...         2        425 days                1
141  Fortaleza 2019-03-02  182.75  ...         2        425 days                1
112     Recife 2019-03-02  133.59  ...         2        425 days                1
139  Fortaleza 2019-03-02  141.16  ...         2        425 days                1
111     Recife 2019-03-02    8.00  ...         2        425 days                1
134     Recife 2019-03-02  195.18  ...         2        425 days                1
127   Salvador 2019-03-02  240.61  ...         2        425 days                1
138  Fortaleza 2019-03-02  150.38  ...         2        425 days                1
71       Natal 2019-03-20  840.00  ...        20        443 days                1
116  Fortaleza 2019-03-02   79.10  ...         2        425 days                1
45       Natal 2019-03-11  431.00  ...        11        434 days                1
123   Salvador 2019-03-02  127.45  ...         2        425 days                1

[20 rows x 12 columns]